{
  "CaptureAllTabs": {
    "message": "Capture all tabs"
  },
  "CaptureFrame": {
    "message": "Capture frame"
  },
  "CaptureFrameBookmark": {
    "message": "Capture frame (bookmark)"
  },
  "CaptureFrameSource": {
    "message": "Capture frame (source)"
  },
  "CaptureLinkBookmark": {
    "message": "Capture linked page (bookmark)"
  },
  "CaptureLinkSource": {
    "message": "Capture linked page (source)"
  },
  "CaptureMedia": {
    "message": "Capture media"
  },
  "CapturePage": {
    "message": "Capture page"
  },
  "CapturePageBookmark": {
    "message": "Capture page (bookmark)"
  },
  "CapturePageSource": {
    "message": "Capture page (source)"
  },
  "CaptureSelection": {
    "message": "Capture selected range(s)"
  },
  "CaptureTab": {
    "message": "Capture tab"
  },
  "CaptureTabBookmark": {
    "message": "Capture tab (bookmark)"
  },
  "CaptureTabBookmarkTooltip": {
    "message": "Capture selected tabs as bookmark pages, which redirects to the source page when navigated."
  },
  "CaptureTabSource": {
    "message": "Capture tab (source)"
  },
  "CaptureTabSourceTooltip": {
    "message": "Capture the original content of the selected tabs (before processed by scripts)."
  },
  "CaptureTabTooltip": {
    "message": "Capture the current status of the selected tabs. Only the selected range(s) is captured if there's a selection in the tab."
  },
  "CapturerTitle": {
    "message": "Capture page"
  },
  "ErrorContentScriptExecute": {
    "message": "Unable to execute content script ($SOURCE$): $REASON$",
    "placeholders": {
      "source": {"content": "$1"},
      "reason": {"content": "$2"}
    }
  },
  "ErrorDocumentNotReady": {
    "message": "Document not loaded completely. Please wait for a while and try again."
  },
  "ErrorFileDownloadError": {
    "message": "Error downloading file ($URL$): $REASON$",
    "placeholders": {
      "url": {"content": "$1"},
      "reason": {"content": "$2"}
    }
  },
  "ErrorImportOptions": {
    "message": "Error on importing options: $REASON$",
    "placeholders": {
      "reason": {"content": "$1"}
    }
  },
  "ErrorTabDiscarded": {
    "message": "Tab discarded. Reload it and try again."
  },
  "ExtensionDescription": {
    "description": "Description of the extension as it's visible to the outside world",
    "message": "Captures the web page faithfully with highly customizable configurations."
  },
  "ExtensionName": {
    "description": "Name of the extension as it's visible to the outside world",
    "message": "WebScrapBook"
  },
  "IndexerDesc": {
    "message": "Indexer only works when captured data are saved in the ScrapBook folder (default: <default download folder>/<Scrapbook Folder>/data/). Move data to the folder if they are not there.\n\nAfter picking the ScrapBook folder, the indexing process will run, and a ZIP file is generated and becomes downloadable. Extract the contents to the original ScrapBook folder and open the generated ./tree/map.html or ./tree/frame.html to view the list of captured pages.\n\nFiles such as ./tree/meta.js and ./tree/toc.js, for metadata and table of contents (TOC) respectively, can be manually edited, as long as the data format is kept correct.\n\nAfter new pages are captured or metadata is edited, run this indexer repeatedly to add newly captured pages and to check for potential errors, and refresh ./tree/map.html or ./tree/frame.html to view the updated result.\n\nAdditional settings for the indexer can be configured in the options page."
  },
  "IndexerHeader": {
    "message": "Pick directories or ZIP archive files of a WebScrapBook folder, via dropping them into this window, or using the buttons below:"
  },
  "IndexerLoadServer": {
    "message": "Load from server"
  },
  "IndexerPickDir": {
    "message": "Pick a folder"
  },
  "IndexerPickDirTooltip": {
    "message": "When selecting a folder in this way, the root directory cannot be correctly identified if the root directory contains only a single folder. Select a folder via dropping, or add a file or a folder containing files to the root directory, to avoid this issue."
  },
  "IndexerPickFiles": {
    "message": "Pick ZIP files"
  },
  "IndexerSearchTitle": {
    "message": "$BOOK$ :: Search",
    "placeholders": {
      "book": {"content": "$1"}
    }
  },
  "IndexerSourceLinkTitle": {
    "message": "Source link"
  },
  "IndexerTitle": {
    "message": "Generate site index"
  },
  "OpenIndexer": {
    "message": "Generate site index"
  },
  "OpenOptions": {
    "message": "Options"
  },
  "OpenScrapBook": {
    "message": "Open ScrapBook"
  },
  "OpenViewer": {
    "message": "View archived page"
  },
  "OptionCaptureAppletLabel": {
    "message": "APPLET:"
  },
  "OptionCaptureAppletTooltip": {
    "message": "Determines how APPLET elements, which are used to embed JAVA applets and are no more supported by most modern browsers, are handled. NOTE: JAVA applets may not work without original server environment, and could cause a security hazard.\n\n* Save: Save the referenced resources to local.\n\n* Link: Rewrite the element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the applet element.\n\n* Remove: Removes the applet element. Note that this could affect the web page layout."
  },
  "OptionCaptureAudioLabel": {
    "message": "Audio:"
  },
  "OptionCaptureAudioTooltip": {
    "message": "Determines how audio elements are handled.\n\n* Save: Save the referenced audio resources to local.\n\n* Save current: An audio element may provide multiple audio versions, one of which is selected by the browser according to supportability. This saves only the currently used audio version to local, which reduces size but the audio may be unplayable on another platform that does not support the version.\n\n* Link: Rewrite the element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the audio element.\n\n* Remove: Removes the audio element. Note that this could affect the web page layout."
  },
  "OptionCaptureAutoCloseDialogLabel": {
    "message": "Auto-close dialog when capture succeeded"
  },
  "OptionCaptureCanvasBlankLabel": {
    "message": "Save initial status"
  },
  "OptionCaptureCanvasLabel": {
    "message": "Canvases:"
  },
  "OptionCaptureCanvasSaveLabel": {
    "message": "Save current status"
  },
  "OptionCaptureCanvasTooltip": {
    "message": "Determines how canvas elements are handled. Canvases are blank initially and drawn by web page scripts.\n\n* Save current status: Generates an initialization script that records the current canvas status to redraw it when the saved web page is loaded. Note that the generated intialization script could introduce a conflict if scripts are saved.\n\n* Save initial status: Saves a blank canvas. This is more recommanded when scripts are saved as they tend to draw the canvases on their own.\n\n* Remove: Removes the canvas element."
  },
  "OptionCaptureCommonBlankLabel": {
    "message": "Blank"
  },
  "OptionCaptureCommonLinkLabel": {
    "message": "Link"
  },
  "OptionCaptureCommonSaveLabel": {
    "message": "Save"
  },
  "OptionCaptureCommonSaveCurrentLabel": {
    "message": "Save current"
  },
  "OptionCaptureCommonSaveUsedLabel": {
    "message": "Save current [Experimental]"
  },
  "OptionCaptureCommonRemoveLabel": {
    "message": "Remove"
  },
  "OptionCaptureDownLinkFilterErrorLine": {
    "message": "Line $LINE$: $ERROR$",
    "placeholders": {
      "line": {"content": "$1"},
      "error": {"content": "$2"}
    }
  },
  "OptionCaptureDownLinkExtFilterError": {
    "message": "The following regular expressions in file extension filter are invalid and will be skipped on execution. Stop to fix them now?\n\n$LINES$",
    "placeholders": {
      "lines": {"content": "$1"}
    }
  },
  "OptionCaptureDownLinkExtFilterDesc": {
    "message": "Determines what to download according to file extension.\n\n* Each following line is a comma-separated list of extensions (case-insensitive and may include spaces, e.g. jpg, jpeg) or a regular expression (e.g. /jpe?g/i).\n\n* The full extension is taken for matching. For example, .doc does not match rule docx.\n\n* Whichever matches a rule at any line are included for download.\n\n* A line starting with \"#\" is regarded as a comment and will be ignored during execution."
  },
  "OptionCaptureDownLinkExtFilterTitle": {
    "message": "File extension filter"
  },
  "OptionCaptureDownLinkModeHeaderLabel": {
    "message": "Match HTTP header and file extension"
  },
  "OptionCaptureDownLinkModeNoneLabel": {
    "message": "Disable download linked files"
  },
  "OptionCaptureDownLinkModeTooltip": {
    "message": "Determines whether and how to download the targeted resource of a link (an A or AREA element).\n\n* Disable download linked files: Do not download the linked resource.\n\n* Match URL file extension: Match the file extension of the URL. This performs better but cannot differenciate dynamically generated resource. For example, a URL whose extension is .php can output a resource of html, doc, pdf, or other type, but the filter always gets \"php\" in this mode.\n\n* Match HTTP header and file extension: Traverse every link to get the HTTP header and the precise extension of the output resource for matching. NOTE: Certain sites make interactive commands as plain hyperlink, which could be unexpectedly triggered during traversal (such as logging out the site). The URL filter can be configured to avoid such trigering."
  },
  "OptionCaptureDownLinkModeUrlLabel": {
    "message": "Match URL file extension"
  },
  "OptionCaptureDownLinkUrlFilterDesc": {
    "message": "Determines what are forbidden for downloading according to full URL (with the \"#\" part stripped).\n\n* Each following line is a full URL (with \"#\" part stripped) or a regular expression (e.g. /[/=]logout\\b/i). \n\n* Whichever matches a rule at any line are forbidden from downloading.\n\n* A line starting with \"#\" is regarded as a comment and will be ignored during execution."
  },
  "OptionCaptureDownLinkUrlFilterError": {
    "message": "The following regular expressions in URL filter are invalid and will be skipped on execution. Stop to fix them now?\n\n$LINES$",
    "placeholders": {
      "lines": {"content": "$1"}
    }
  },
  "OptionCaptureDownLinkUrlFilterTitle": {
    "message": "URL filter"
  },
  "OptionCaptureEmbedLabel": {
    "message": "EMBED:"
  },
  "OptionCaptureEmbedTooltip": {
    "message": "Determines how embed elements, which are typically used to include plugins, and sometimes images, media, or frames, are handled. NOTE: Plugins may not work without original server environment, and could cause a security hazard.\n\n* Save: Save the referenced resources to local.\n\n* Link: Rewrite the element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the embed element.\n\n* Remove: Removes the embed element. Note that this could affect the web page layout."
  },
  "OptionCaptureFaviconLabel": {
    "message": "Favicon:"
  },
  "OptionCaptureFaviconTooltip": {
    "message": "Determines how favicons, which are shown in the tab, bookmarks or my favorites, are handled.\n\n* Save: Save the referenced favicon resources to local.\n\n* Link: Rewrite the favicon element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the favicon element.\n\n* Remove: Removes the favicon element."
  },
  "OptionCaptureFontLabel": {
    "message": "Fonts:"
  },
  "OptionCaptureFontTooltip": {
    "message": "Determines how external fonts are handled.\n\n* Save: Save the referenced font resources to local.\n\n* Save current: Save only the fonts that are actually used by an element in the current web page. This reduces size. (Due to the security restriction of same origin policy, stylesheets from a different origin cannot be analysed and their external fonts will be all saved as a fallback.)\n\n* Link: Rewrite the stylesheet declaration to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Clears the stylesheet declaration for an external font."
  },
  "OptionCaptureFormStatusLabel": {
    "message": "Form status:"
  },
  "OptionCaptureFormStatusKeepLabel": {
    "message": "Keep"
  },
  "OptionCaptureFormStatusResetLabel": {
    "message": "Reset"
  },
  "OptionCaptureFrameLabel": {
    "message": "Frames:"
  },
  "OptionCaptureFrameTooltip": {
    "message": "Determines how frames (FRAME and IFRAME elements) are handled.\n\n* Save: Save the frame pages to local.\n\n* Link: Rewrite frame elements to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the frame elements.\n\n* Remove: Removes the frame elements. Note that this could affect the web page layout."
  },
  "OptionCaptureImageBackgroundLabel": {
    "message": "Background images:"
  },
  "OptionCaptureImageBackgroundTooltip": {
    "message": "Determines how background images are handled.\n\n* Save: Save the referenced resources to local.\n\n* Save current: Save only the background images that are applied to an element in the current web page. This reduces size. (Due to the security restriction of same origin policy, stylesheets from a different origin cannot be analysed and their background images will be all saved as a fallback.)\n\n* Link: Rewrite the stylesheet declaration to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Clear the stylesheet declaration of the background image."
  },
  "OptionCaptureImageLabel": {
    "message": "Images:"
  },
  "OptionCaptureImageTooltip": {
    "message": "Determines how images (IMG or PICTURE elements) are handled.\n\n* Save: Save the referenced image resources to local.\n\n* Save current: An image element could contain multiple versions, one of which is selected by the browser according to viewport size and/or screen resolution. This saves only the currently used image version to local, which reduces size but the display effect on another platform might be suboptimal. If the captured page is not displayed (such as capturing source), all versions are still saved.\n\n* Link: Rewrite the image element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the image element.\n\n* Remove: Removes the image element. Note that this could affect the web page layout."
  },
  "OptionCaptureNoscriptLabel": {
    "message": "NOSCRIPT:"
  },
  "OptionCaptureNoscriptTooltip": {
    "message": "Determines how noscript elements, which are showed when the browser does not or has disabled support of scripts, are handled.\n\n* Save: Save the noscript element as-is.\n\n* Blank: Clears the noscript element.\n\n* Remove: Removes the noscript element. Note that this could affect the web page layout."
  },
  "OptionCaptureObjectLabel": {
    "message": "OBJECT:"
  },
  "OptionCaptureObjectTooltip": {
    "message": "Determines how object elements, which are typically used to include plugins, and sometimes images, media, or frames, are handled. NOTE: Plugins may not work without original server environment, and could cause a security hazard.\n\n* Save: Save the referenced resources to local.\n\n* Link: Rewrite the element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the object element.\n\n* Remove: Removes the object element. Note that this could affect the web page layout."
  },
  "OptionCaptureRecordRewrittenAttrLabel": {
    "message": "Record rewritten attributes"
  },
  "OptionCaptureRecordRewrittenAttrTooltip": {
    "message": "If an attribute is rewritten during the capture process, create a corresponding data-* attribute to record its original value."
  },
  "OptionCaptureRecordErrorUriLabel": {
    "message": "Record error URL"
  },
  "OptionCaptureRecordErrorUriTooltip": {
    "message": "If connection to a URL failed during the capture process, record it as urn:scrapbook:*. If unchecked, link to the source address (which could still be unavailable and be an invalid connection)."
  },
  "OptionCaptureRecordRemovedNodeLabel": {
    "message": "Record removed elements"
  },
  "OptionCaptureRecordRemovedNodeTooltip": {
    "message": "If an element is removed during the capture process, create an HTML comment in place to record its original content."
  },
  "OptionCaptureRecordSourceUriLabel": {
    "message": "Record source URL"
  },
  "OptionCaptureRecordSourceUriTooltip": {
    "message": "If a URL is rewritten during the capture process, create a data-* attribute or HTML comment to record its original address."
  },
  "OptionCaptureRewriteCssLabel": {
    "message": "Rewrite CSS:"
  },
  "OptionCaptureRewriteCssNoneLabel": {
    "message": "No rewrite"
  },
  "OptionCaptureRewriteUrlLabel": {
    "message": "Rewrite URL"
  },
  "OptionCaptureSaveAsciiFilenameLabel": {
    "message": "Save ASCII filename"
  },
  "OptionCaptureSaveAsciiFilenameTooltip": {
    "message": "The captured file will have non-ASCII chars in the filename encoded."
  },
  "OptionCaptureSaveAsFolderLabel": {
    "message": "Folder"
  },
  "OptionCaptureSaveAsLabel": {
    "message": "Save captured data as:"
  },
  "OptionCaptureSaveAsTooltip": {
    "message": "Determines how the web page and referenced files are saved.\n\n* Folder: Generates a folder and save the web page and resource files into it. NOTE for Chromium: It's recommended that \"Ask where to save each file before downloading\" be unchecked to avoid tons of prompts. Additionally, several file formats would be blocked by a built-in filter, and the user has to select \"Keep\" one by one to download them.\n\n* HTZ or MAFF package: Packs web page and referenced resources in to a single file using ZIP algorithm. Such files can be viewed using the \"View archive page\" feature or by unzipping them.\n\n* Single HTML: Stores the referenced resource as data URL, which is supported by most browsers, such as Chromium > 0, Firefox > 0, Edge > 0, Safari > 0, Opera ≥ 7.2, and IE ≥ 8 (very limited in IE). NOTE: Data URLs are less performant and does not deduplicate, and thus a web page referencing a large resource for multiple times could lead to a bloat of file size.\n\n* Scripted single HTML: Stores referenced resources in the script and re-generate them on loading. This has better performance and reduced size compared with data URL, but requires a modern browser with JavaScript enabled, such as: Chromium ≥ 20, Firefox ≥ 13, Edge > 0, Safari ≥ 6, Opera ≥ 12.1, and IE ≥ 10."
  },
  "OptionCaptureSaveAsMaffLabel": {
    "message": "MAFF package"
  },
  "OptionCaptureSaveAsSingleHtmlJsLabel": {
    "message": "Scripted single HTML"
  },
  "OptionCaptureSaveAsSingleHtmlLabel": {
    "message": "Single HTML"
  },
  "OptionCaptureSaveAsZipLabel": {
    "message": "HTZ package"
  },
  "OptionCaptureSaveDataUriAsFileLabel": {
    "message": "Save data URL as file"
  },
  "OptionCaptureSaveDataUriAsFileTooltip": {
    "message": "A filename will be auto-generated according to the MIME type and the SHA-1 hash of the content of the data URL. The original filename will be stored in the data URL using a special attribute."
  },
  "OptionCaptureSaveFileAsHtmlLabel": {
    "message": "Save file as HTML"
  },
  "OptionCaptureSaveFileAsHtmlTooltip": {
    "message": "Save a browser-viewable non-HTML file as an HTML web page."
  },
  "OptionCaptureSaveToFileLabel": {
    "message": "Individual file"
  },
  "OptionCaptureSaveToFolderLabel": {
    "message": "Scrapbook folder"
  },
  "OptionCaptureSaveToLabel": {
    "message": "Save captured data to:"
  },
  "OptionCaptureSaveToServerLabel": {
    "message": "Backend server"
  },
  "OptionCaptureSaveToTooltip": {
    "message": "Determines how captured data files are managed.\n\n* Backend server: a captured web page is saved in the configured book and data directory in the backend server, and named after an ID made of the current date and time for later indexing.\n\n* Scrapbook folder: a captured web page is saved in the scrapbook folder (<default download folder>/<scrapbook Folder>/data/ or the configured data directory of the backend server) and named after an ID made of the current date and time for later indexing.\n\n* Individual file: a captured web page is saved as a file named after it's title and is saved to the <default download folder> or a path specified by the user. This is more suitable for storing and sharing an individual web page."
  },
  "OptionCaptureScrapbookFolderLabel": {
    "message": "Scrapbook folder:"
  },
  "OptionCaptureScrapbookFolderTooltip": {
    "message": "The top-level folder scrapbook data are saved in. This is a path under the <default download folder>, and can be \"WebScrapBook\", or \"my/webscrapbook\", etc.\n\n* To specify a folder beyond the <default download folder>, create a soft link (symbolic or junction) under <default download folder> and targets the desired folder, and set the this to be the path of the link."
  },
  "OptionCaptureScriptLabel": {
    "message": "Scripts:"
  },
  "OptionCaptureScriptTooltip": {
    "message": "Determines how all scripts—including SCRIPT elements, links with javascript: protocol, and dynamic attributes such as onclick, etc.—are handled. NOTE: Scripts are sometimes context dependant, and thus loss of original server environment and/or certain rewrittings of the web page during capturing could cause the saved scripts to not work. Additionally, scripts won't run in the archive page viewer for security reasons.\n\n* Save: Save the referenced script resource to local.\n\n* Link: Rewrite the element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the script element.\n\n* Remove: Removes the script element. Note that this could affect the web page layout."
  },
  "OptionCaptureStyleInlineLabel": {
    "message": "Inline styles:"
  },
  "OptionCaptureStyleInlineTooltip": {
    "message": "Determines how inline stylesheets are handled.\n\n* Save: Save inline stylesheets.\n\n* Blank: Clear the inline style attribute.\n\n* Remove: Removes the inline style attribute."
  },
  "OptionCaptureStyleLabel": {
    "message": "Styles:"
  },
  "OptionCaptureStyleTooltip": {
    "message": "Determines how external stylesheets are handled.\n\n* Save: Save the referenced stylesheet resource to local.\n\n* Link: Rewrite the stylesheet element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the stylesheet element.\n\n* Remove: Removes the stylesheet element."
  },
  "OptionCaptureVideoLabel": {
    "message": "Video:"
  },
  "OptionCaptureVideoTooltip": {
    "message": "Determines how video elements are handled.\n\n* Save: Save the referenced video resource to local.\n\n* Save current: A video element may provide multiple video versions, one of which is selected by the browser according to supportability. This saves only the currently used video version to local, which reduces size but the video may be unplayable on another platform that does not support the version.\n\n* Link: Rewrite the video element to link to source URL. Note that a network flow will be triggered when browsing the captured document in the future.\n\n* Blank: Disables the video element.\n\n* Remove: Removes the video element. Note that this could affect the web page layout."
  },
  "OptionGroupCapture": {
    "message": "Capture - content"
  },
  "OptionGroupDownLink": {
    "message": "Capture - Download linked files"
  },
  "OptionGroupIndexer": {
    "message": "Indexer"
  },
  "OptionGroupMetadata": {
    "message": "Capture - metadata"
  },
  "OptionGroupSave": {
    "message": "Capture - saving"
  },
  "OptionGroupServer": {
    "message": "Backend server"
  },
  "OptionGroupViewer": {
    "message": "Viewer"
  },
  "OptionIndexerFulltextCacheFrameAsPageContentLabel": {
    "message": "Cache frame content as main document content"
  },
  "OptionIndexerFulltextCacheLabel": {
    "message": "Update fulltext cache"
  },
  "OptionPageTitle": {
    "message": "Options"
  },
  "OptionServerPasswordLabel": {
    "message": "Password:"
  },
  "OptionServerUrlLabel": {
    "message": "Address:"
  },
  "OptionServerUrlTooltip": {
    "message": "The root path of the backend server application, such as “http://localhost:8080/” or “https://example.com/wsb/”.\n\n* The backend server can be hosted using webscrapbook package (compatible: $BACKEND_VERSION$) of Python. See https://pypi.org/project/webscrapbook/ for further details.",
    "placeholders": {
      "backend_version": {"content": "$1"}
    }
  },
  "OptionServerUserLabel": {
    "message": "User:"
  },
  "OptionsExportLabel": {
    "message": "Export"
  },
  "OptionsImportLabel": {
    "message": "Import"
  },
  "OptionsImportSuccess": {
    "message": "Successfully imported options."
  },
  "OptionsSaveLabel": {
    "message": "Save"
  },
  "OptionsResetLabel": {
    "message": "Reset"
  },
  "OptionViewerUseFileSystemApiLabel": {
    "message": "Use Filesystem API"
  },
  "OptionViewerUseFileSystemApiTooltip": {
    "message": "Use filesystem API to create a virtual filesystem and view the archive file when supported, to get a better performance and fidelity."
  },
  "OptionViewerViewHtzLabel": {
    "message": "View HTZ file"
  },
  "OptionViewerViewHtzTooltip": {
    "message": "When the browser loads an HTZ file, view it with the viewer. Check \"Allow access to file URLs\" in a supported browser to enable opening such files directly."
  },
  "OptionViewerViewMaffLabel": {
    "message": "View MAFF file"
  },
  "OptionViewerViewMaffTooltip": {
    "message": "When the browser loads a MAFF file, view it with the viewer. Check \"Allow access to file URLs\" in a supported browser to enable opening such files directly."
  },
  "ViewerDesc": {
    "message": "Pick HTZ or MAFF archive files to open, via dropping them into this window, or using the buttons below:"
  },
  "ViewerPickFiles": {
    "message": "Pick ZIP files"
  },
  "ViewerTitle": {
    "message": "View archive page"
  },
  "WarnCaptureCircular": {
    "message": "Resource '$SOURCE$' has a circular reference to '$TARGET$', which will be blanked because current capture configuration does not support circular reference.",
    "placeholders": {
      "source": {"content": "$1"},
      "target": {"content": "$2"}
    }
  },

  "OK": {
    "message": "OK"
  },
  "Cancel": {
    "message": "Cancel"
  },

  "ScrapBookMainNewFolderName": {
    "description": "Default name of a new folder",
    "message": "New Folder"
  },
  "ScrapBookMainNewNoteName": {
    "description": "Default name of a new note",
    "message": "New Note"
  },
  "ScrapBookMainBookRefresh": {
    "message": "<Refresh>"
  },
  "ScrapBookMainCommandIndex": {
    "message": "View index page"
  },
  "ScrapBookMainCommandOpen": {
    "message": "Open"
  },
  "ScrapBookMainCommandOpenTab": {
    "message": "Open in new tab"
  },
  "ScrapBookMainCommandExec": {
    "message": "Open locally"
  },
  "ScrapBookMainCommandExecBook": {
    "message": "View directory locally"
  },
  "ScrapBookMainCommandBrowse": {
    "message": "Browse locally"
  },
  "ScrapBookMainCommandSource": {
    "message": "View source"
  },
  "ScrapBookMainCommandManage": {
    "message": "Manage"
  },
  "ScrapBookMainCommandMeta": {
    "message": "Metadata"
  },
  "ScrapBookMainCommandCreatefolder": {
    "message": "New folder"
  },
  "ScrapBookMainCommandCreateSeparator": {
    "message": "New separator"
  },
  "ScrapBookMainCommandCreateNote": {
    "message": "New Note"
  },
  "ScrapBookMainCommandEdit": {
    "message": "Edit"
  },
  "ScrapBookMainCommandEditx": {
    "message": "Edit page"
  },
  "ScrapBookMainCommandUpload": {
    "message": "Upload"
  },
  "ScrapBookMainCommandMoveUp": {
    "message": "Move up"
  },
  "ScrapBookMainCommandMoveDown": {
    "message": "Move down"
  },
  "ScrapBookMainCommandMoveTo": {
    "message": "Move to"
  },
  "ScrapBookMainCommandRecycle": {
    "message": "Remove"
  },
  "ScrapBookMainCommandDelete": {
    "message": "Delete"
  },
  "ScrapBookMainCommandViewRecycle": {
    "message": "View recycle bin"
  },
  "ScrapBookMainCommandMetaDialogId": {
    "message": "ID:"
  },
  "ScrapBookMainCommandMetaDialogTitle": {
    "message": "Title:"
  },
  "ScrapBookMainCommandMetaDialogIndex": {
    "message": "Index:"
  },
  "ScrapBookMainCommandMetaDialogSource": {
    "message": "Source:"
  },
  "ScrapBookMainCommandMetaDialogIcon": {
    "message": "Icon:"
  },
  "ScrapBookMainCommandMetaDialogType": {
    "message": "Type:"
  },
  "ScrapBookMainCommandMetaDialogCreate": {
    "message": "Create:"
  },
  "ScrapBookMainCommandMetaDialogModify": {
    "message": "Modify:"
  },
  "ScrapBookMainCommandMetaDialogComment": {
    "message": "Comment:"
  },
  "ScrapBookMainCommandCreateNoteDialogTitle": {
    "message": "Format of the new note:"
  },
  "ScrapBookMainCommandMoveDialogTitle": {
    "message": "Move into the item of this ID:"
  },
  "ScrapBookMainErrorServerNotConfigured": {
    "message": "Backend server is not configured."
  },
  "ScrapBookMainErrorServerInit": {
    "message": "Backend initilization error: $REASON$",
    "placeholders": {
      "reason": {"content": "$1"}
    }
  },
  "ScrapBookMainErrorBookNotExist": {
    "message": "Scrapbook $NAME$ does not exist. Reset to default scrapbook.",
    "placeholders": {
      "name": {"content": "$1"}
    }
  },
  "ScrapBookMainErrorLoadBooks": {
    "message": "Unable to load scrapbooks: $REASON$",
    "placeholders": {
      "reason": {"content": "$1"}
    }
  },
  "ScrapBookMainErrorInitTree": {
    "message": "Unable to init tree: $REASON$",
    "placeholders": {
      "reason": {"content": "$1"}
    }
  },
  "ScrapBookMainErrorServerTreeChanged": {
    "message": "Tree data in the server has been changed. Refresh the page and try again."
  }
}
